{
    "scrape_timestamp_utc": "2025-06-26T03:02:41.420499Z",
    "search_query": "Pacers NBA 2025",
    "articles": [
        {
            "title": "Indiana Pacers Scores, Stats and Highlights - ESPN",
            "url": "https://www.espn.com/nba/team/_/name/ind/indiana-pacers",
            "source_snippet": "3 hours ago ... Visit ESPN for Indiana Pacers live scores, video highlights, and latest news ... NBA trade tracker: Live updates during the 2025 draft. 1h; ESPN. NBA trade ...",
            "scraped_content": "Indiana Pacers Scores, Stats and Highlights - ESPN Skip to main content Skip to navigation ESPN NFL NFL NBA NBA NHL NHL MLB MLB WNBA WNBA Soccer Soccer Tennis Tennis More Sports More Sports ESPN Plus ESPN BET Watch Watch Fantasy Fantasy Search Indiana Pacers Follow 50-32 2nd in Central Division Home Stats Schedule Roster Depth Injuries Transactions Fantasy Men's Basketball Tickets External Link More More 2024-25 Schedule Postseason @ Thunder L 103-91 vs Thunder W 108-91 @ Thunder L 120-109 vs Thunder L 111-104 vs Thunder W 116-107 @ Thunder L 123-107 @ Thunder W 111-110 vs Knicks W 125-108 @ Knicks L 111-94 vs Knicks W 130-121 vs Knicks L 106-100 @ Knicks W 114-109 @ Knicks W 138-135 @ Cavaliers W 114-105 vs Cavaliers W 129-109 vs Cavaliers L 126-104 @ Cavaliers W 120-119 @ Cavaliers W 121-112 vs Bucks W 119-118 @ Bucks W 129-103 @ Bucks L 117-101 vs Bucks W 123-115 vs Bucks W 117-98 Regular Season @ Cavaliers W 126-118 vs Magic L 129-115 Full Schedule NBA trade tracker: Live updates during the 2025 draft 42m ESPN Scott Kinser/Imagn Images How do the NBA draft and free agency work? 3h Keith Jenkins Brad Penner/Imagn Images Fits before the picks: NBA draft night drip takes center stage 3h ESPN Staff Sarah Stier/Getty Images Two-round NBA mock draft: What we're hearing hours from the draft 4h Jonathan Givony, Jeremy Woo ESPN Pacers NBA Pacers NBA Hour 3: I'm Just Keeping It Real, Right? Freddie Coleman and David Dennis Jr. wonder if the Celtics should trade Jaylen Brown. The fellas do some Real or Not Real for contenders in the East next season in the NBA. Plus callers weigh in on which draft pick their team made that continues to haunt them to this day. Learn more about your ad choices. Visit podcastchoices.com/adchoices 5h Pacers NBA Experts cite overuse in spate of Achilles injuries in NBA 11h Maria Lawson Photo by Elsa/Getty Images Pacers NBA Hour 4: Look At Luka Freddie Coleman and David Dennis Jr. pick which NBA team has the most intriguing offseason coming up on the horizon. David has great reaction to reports that Luka Doncic is looking slim. Plus callers continue to weigh in on today's Selection Committee: Top Summer Blockbusters. Learn more about your ad choices. Visit podcastchoices.com/adchoices 1d Pacers NBA Hour 2: Best Summer Blockbusters Freddie Coleman and David Dennis Jr. do this week's Selection Committee on the Best Summer Blockbusters. Dr. Andre Snellings stops by. Plus callers weigh in on their favorite Summer Movies. Learn more about your ad choices. Visit podcastchoices.com/adchoices 1d Hour 1: Looter In A Riot Joe Fortenbaugh & Jonathan Zaslow (in for Q) discuss what the Celtics trading Jrue Holiday signifies for their future and who could be next. Did Tyrese Haliburton put to bed all questions about whether he should've played in Games 6 and 7? BREAKING: Aaron Rodgers said 2025 will be his final season. We'll see! Learn more about your ad choices. Visit podcastchoices.com/adchoices 1d Back to Top 2024-25 Central Standings Team W L PCT GB STRK Cleveland 64 18 .780 - L1 Indiana 50 32 .610 14 W1 Milwaukee 48 34 .585 16 W8 Detroit 44 38 .537 20 L2 Chicago 39 43 .476 25 W3 Full Standings 2024-25 Team Leaders Offense Defense Points Per Game Pascal Siakam PF #43 20.2 MIN 32.7 FG% 51.9 Assists Per Game Tyrese Haliburton PG #0 9.2 PPG 18.6 TO 1.6 Field Goal Percentage Obi Toppin PF #1 52.9 MIN 19.6 PPG 10.5 Full Team Statistics 2024-25 Team Stats Points Per Game 117.4 Rebounds Per Game 41.8 Assists Per Game 29.2 Full Team Stats Injuries Jarace Walker F #5 Day-To-Day Isaiah Jackson SF #22 Day-To-Day Tyrese Haliburton PG #0 Out Team Injuries 2025 Draft Picks RD(PK) PLAYER POS SCHOOL 2(24) All 2025 Draft Picks Team History Year W L PCT 2023-24 47 35 .573 2022-23 35 47 .427 2021-22 25 57 .305 Terms of Use Privacy Policy Your US State Privacy Rights Children's Online Privacy Policy Interest-Based Ads About Nielsen Measurement Do Not Sell or Share My Personal Information Contact Us Disney Ad Sales Site Work for ESPN Corrections ESPN BET Sportsbook is owned and operated by PENN Entertainment, Inc. and its subsidiaries ('PENN'). ESPN BET is available in states where PENN is licensed to offer sports wagering. Must be 21+ to wager. If you or someone you know has a gambling problem and wants help, call 1-800-GAMBLER. Copyright: © 2025 ESPN Enterprises, Inc. All rights reserved."
        },
        {
            "title": "2025 NBA Playoffs | Home | NBA.com",
            "url": "https://www.nba.com/playoffs/2025",
            "source_snippet": "1 day ago ... Shai Gilgeous-Alexander wins Finals MVP after a dominant Game 7, adding to his Kia NBA MVP and scoring title. June 23, 2025 · Pacers are runners-up to remember ...",
            "scraped_content": "2025 NBA Playoffs | Home | NBA.com Navigation Toggle NBA Draft Home All Picks: 1-59 Draft Board Prospects Teams Trade Tracker Home Tickets Featured NBA TV Home Top Stories Draft Summer League Features Events Key Dates Transactions Future Starts Now History More Finals Hub: OKC vs. IND Bracket All Playoffs Series Stats Home Dunk Score Players Teams Leaders Stats 101 Cume Stats Lineups Tool Media Central Game Stats Draft Quick Links Contact Us Atlantic Boston Celtics Brooklyn Nets New York Knicks Philadelphia 76ers Toronto Raptors Central Chicago Bulls Cleveland Cavaliers Detroit Pistons Indiana Pacers Milwaukee Bucks Southeast Atlanta Hawks Charlotte Hornets Miami Heat Orlando Magic Washington Wizards Northwest Denver Nuggets Minnesota Timberwolves Oklahoma City Thunder Portland Trail Blazers Utah Jazz Pacific Golden State Warriors LA Clippers Los Angeles Lakers Phoenix Suns Sacramento Kings Southwest Dallas Mavericks Houston Rockets Memphis Grizzlies New Orleans Pelicans San Antonio Spurs Players Home 2024-25 Audio Pronunciation Guide Player Stats Starting Lineups Free Agent Tracker Transactions Home Full Court Guess Rank IQ Player Path Trivia Hoop Connect Fantasy Home Bracket Challenge NBA Pick'Em Play Yahoo Fantasy Play Sorare NBA FantasyPros Tools FanDuel DFS Draft Kings DFS NBA Bet Authorized Gaming Operators NBA Store Jerseys Men Women Kids Custom Shop Hardwood Classics Hats Footwear Auctions NBA Game Worn NYC Store NBA Photo Store NBATickets.com Official Tickets by Ticketmaster NBA Experiences NBA G League WNBA NBA 2K League Basketball Africa League Draft NBA Finals Free Agency League Pass Games Watch News Stats Standings Teams Players NBA Play Fantasy Store Tickets Affiliates 2025 NBA Finals Summary News Stats Schedule Bracket All Series LATEST PLAYOFF NEWS Best moments from championship parade The Thunder traversed downtown OKC to celebrate their 2025 NBA championship with their fans. Trending Topics: Will Thunder run it back? Oklahoma City is savoring its 2024-25 NBA title, but will the champs be in this same spot next year? Our writers weigh in. Chasing History: Thunder Make History! Go behind the scenes with the Thunder, who are NBA Champions for the first time in OKC era after winning Game 7 against a resilient Indiana Pacers team. 5 takeaways: SGA, defense key to Game 7 win Shai Gilgeous-Alexander sets the tone, while OKC rides its defense and depth to finish off the relentless Pacers in Game 7. Gilgeous-Alexander named 2025 NBA Finals MVP Shai Gilgeous-Alexander wins Finals MVP after a dominant Game 7, adding to his Kia NBA MVP and scoring title. Pacers are runners-up to remember Though it couldn't quite pull off the upset, Indiana leaves an indelible legacy with its remarkable postseason run. Young Thunder set up for potential dynasty OKC boasts 10 1st-round picks in the next 5 Drafts, an enviable war chest to replenish what is already a championship roster. Haliburton undergoes surgery on Achilles Indiana's star shares a heartfelt message on social media after having surgery that could sideline him for the 2025-26 season. CHASING HISTORY See More 01:07:32 Chasing History: 2025 NBA Finals Movie 14:29 Chasing History: Thunder Make History! 07:17 Chasing History: Finals go the distance 08:39 Chasing History: Thunder take control in Game 5 10:06 Chasing History: SGA takes over late in Game 4 09:50 Chasing History: Pacers contain SGA, take 2-1 lead 07:41 Chasing History: Thunder bounce back in Game 2 09:30 Chasing History: Pacers stun Thunder in Game 1 41:13 Chasing History: An inside look at conference finals 04:33 Chasing History: Another classic comeback HIGHLIGHTS & ANALYSIS See More 01:36 Role Players Rise in Pacers’ Playoff Run 30:13 SGA's best plays of 2025 playoffs 32:50 Tyrese Haliburton's best plays of 2025 playoffs 01:03 Heard Around the World: Tyrese Haliburton Game-Tying Shot vs NYK in Game 1 03:42 Can surging Pacers topple rolling Thunder? 04:12 How Giddey-for-Caruso explains Thunder culture 00:18 Alternate Angle of Tyrese Haliburton Lob to Obi Toppin in Game 3 of the ECF 00:16 Alternate Angle of Chet Holmgren’s Alley-Oop Dunk in Game 2 of the WCF 07:28 How confident is OKC ahead of Finals? 02:30 Full Focus: Pacers advance to NBA Finals 07:42 Final thoughts on 36 seasons of NBA on TNT 06:27 Kevin Harlan signs off on final NBA on TNT call FULL FOCUS See More 03:34 Full Focus: Thunder secure NBA championship 01:28 Full Focus: Pacers fire on all cylinders, force Game 7 02:23 Full Focus: Jalen Williams leads OKC to 3-2 lead 03:30 Full Focus: Thunder rally in 4th, even Finals at 2-2 02:23 Full Focus: Pacers bench dominates in Game 3 01:47 Full Focus: Thunder even series behind SGA’s gem 02:39 Full Focus: Pacers stun Thunder in Game 1 02:30 Full Focus: Pacers advance to NBA Finals 01:53 Full Focus: Brunson, Knicks force Game 6 02:03 Full Focus: Haliburton, Pacers seize 3-1 lead MORE FROM THE PLAYOFFS SoFi NBA Play-In Tournament The Warriors, Grizzlies, Magic and Heat advanced from the 2025 SoFi NBA Play-In Tournament. 2025 NBA Playoffs: Schedule and results The 2025 NBA Finals are set. The Pacers' explosive offense meets the Thunder's relentless defense on the NBA's biggest stage. Gone Fishin' time for Knicks, NBA on TNT Take a look at every Gone Fishin’ segment on Inside the NBA from the 2025 NBA playoffs. 2025 NBA Finals Schedule The 2025 NBA Finals Presented by YouTube TV are underway with ABC as the exclusive broadcaster. Top moments in NBA Finals history Countless memorable moments have taken place on the NBA’s grandest stage and these are some of the best of all time. Every NBA Finals winner in history Take a look back at every team to win an NBA championship in league history. NBA Organization NBA ID NBA Official NBA Careers NBA Fan Code of Conduct NBA Initiatives NBA Total Health NBA Cares Jr. NBA / Jr. WNBA NBA Foundation Social Justice Coalition Across The League NBA Communications Lockervision NBA Transactions Shop Global Stores NYC Store NBA Auctions NBA Photostore Subscriptions League Pass Customer Support"
        },
        {
            "title": "Indiana Pacers 2025 NBA Draft picks and notable free agents | FOX ...",
            "url": "https://www.foxsports.com/stories/nba/updated-list-indiana-pacers-2025-nba-draft-picks-entering-draft-week",
            "source_snippet": "11 hours ago ... Full list of Indiana Pacers 2025 NBA Draft picks, including acquired selections, trade details and prospects to watch entering draft week.",
            "scraped_content": "Indiana Pacers 2025 NBA Draft picks and notable free agents | FOX Sports my favs Access and manage your favorites here DISMISS Scores Watch GOLD CUP 🏆 Odds FOX Super 6 Stories Daily Lists Search Sign In Account SPORTS & TEAMS PLAYERS SHOWS PERSONALITIES POPULAR SEARCHES - No Data Available - BROWSE BY SPORTS & TEAMS PLAYERS SHOWS PERSONALITIES Built on NBA NBA NBA Atlanta Hawks Boston Celtics Brooklyn Nets Charlotte Hornets Chicago Bulls Cleveland Cavaliers Dallas Mavericks Denver Nuggets Detroit Pistons Golden State Warriors Houston Rockets Indiana Pacers LA Clippers Los Angeles Lakers Memphis Grizzlies Miami Heat Milwaukee Bucks Minnesota Timberwolves New Orleans Pelicans New York Knicks Oklahoma City Thunder Orlando Magic Philadelphia 76ers Phoenix Suns Portland Trail Blazers Sacramento Kings San Antonio Spurs Toronto Raptors Utah Jazz Washington Wizards National Basketball Association National Basketball Association Indiana Pacers 2025 NBA Draft picks and notable free agents Updated Jun. 25, 2025 12:00 p.m. ET share facebook x reddit link The 2025 NBA Draft is here! Check out the complete list of NBA Draft picks for the Indiana Pacers : How many picks do the Indiana Pacers have in the 2025 NBA Draft? The Indiana Pacers have one draft pick in the 2025 NBA Draft. Nick Wright says people are ‘morons’ if they think the NBA Draft is rigged | The Herd 2025 Indiana Pacers Draft Picks Round 2, Pick 54 Pacers Notable Free Agents The Pacers have seven players that could enter free agency. Here are the most notable players and their status below: Myles Turner (Unrestricted) The Pacers have made it clear they want to retain Turner , including head coach Rick Carlisle saying so publicly. That’s even more likely now that Indiana reached the NBA Finals. Turner, the longest-tenured Pacer since being drafted in 2015, averaged 15.6 points and 6.5 rebounds in the regular season. He posted slightly lower numbers in the playoffs but remains a key piece. It’s hard to see him leaving Indiana after such a successful year, but in the NBA, nothing is certain. share recommended Kyrie Irving Will Reportedly Make 3-Year, $119 Million Commitment to Mavs Best Available 2025 NBA Free Agents: LeBron James, Kyrie Irving Top the List Celtics reportedly trade Kristaps Porzingis to Hawks 2025 NBA Offseason Buzz: Rockets Sign Fred VanVleet to New Deal Nuggets President Josh Kroenke Mentions Nikola Jokic Trade Scenario Out Of Nowhere Tyrese Haliburton Has Achilles Surgery: 'Watch How I Come Back From This' LeBron James: 'Cooper Flagg is Going to be Amazing' on Mavericks Three Achilles injuries in one NBA postseason: What’s going on and how is it fixed? NIL Money is Reshaping the NBA Draft: Fewer Early Entrants and Stars Leaving Get more from National Basketball Association Follow your favorites to get information about games, news and more in this topic Indiana Pacers NEXT STORY 2025 NBA offseason trade tracker, grades: Jazz get Walter Clayton in Draft Day Trade recommended Kyrie Irving Will Reportedly Make 3-Year, $119 Million Commitment to Mavs Best Available 2025 NBA Free Agents: LeBron James, Kyrie Irving Top the List Celtics reportedly trade Kristaps Porzingis to Hawks 2025 NBA Offseason Buzz: Rockets Sign Fred VanVleet to New Deal Nuggets President Josh Kroenke Mentions Nikola Jokic Trade Scenario Out Of Nowhere Tyrese Haliburton Has Achilles Surgery: 'Watch How I Come Back From This' LeBron James: 'Cooper Flagg is Going to be Amazing' on Mavericks Three Achilles injuries in one NBA postseason: What’s going on and how is it fixed? NIL Money is Reshaping the NBA Draft: Fewer Early Entrants and Stars Leaving Top Leagues NFL College Football LIV Golf MLB College Basketball UFL Top Shows The Herd with Colin Cowherd First Things First Speak Breakfast Ball The Facility Affiliated Apps FOX Sports Quick Links 2025 Gold Cup FIFA World Cup 2026™ FOX SPORTS™, SPEED™, SPEED.COM™ & © 2025 Fox Media LLC and\n      Fox Sports Interactive Media, LLC. All rights reserved. Use of this\n      website (including any and all parts and components) constitutes your\n      acceptance of these Updated Terms of Use and Privacy Policy | Advertising Choices | Your Privacy Choices | Closed Captioning Help Press Advertise with Us Jobs FOX Cincy RSS Sitemap FS1 FOX FOX News Fox Corporation FOX Sports Supports FOX Deportes"
        },
        {
            "title": "Pacers star Tyrese Haliburton undergoes surgery on right Achilles ...",
            "url": "https://www.nba.com/news/star-guard-tyrese-haliburton-tears-right-achilles-tendon-pacers-confirm",
            "source_snippet": "1 day ago ... ... NBA. Download the NBA App · 2025 NBA playoff results. INDIANAPOLIS (AP) — Tyrese Haliburton took the Indiana Pacers to heights few thought ...",
            "scraped_content": "Pacers star Tyrese Haliburton undergoes surgery on right Achilles tendon | NBA.com Navigation Toggle NBA Draft Home All Picks: 1-59 Draft Board Prospects Teams Trade Tracker Home Tickets Featured NBA TV Home Top Stories Draft Summer League Features Events Key Dates Transactions Future Starts Now History More Finals Hub: OKC vs. IND Bracket All Playoffs Series Stats Home Dunk Score Players Teams Leaders Stats 101 Cume Stats Lineups Tool Media Central Game Stats Draft Quick Links Contact Us Atlantic Boston Celtics Brooklyn Nets New York Knicks Philadelphia 76ers Toronto Raptors Central Chicago Bulls Cleveland Cavaliers Detroit Pistons Indiana Pacers Milwaukee Bucks Southeast Atlanta Hawks Charlotte Hornets Miami Heat Orlando Magic Washington Wizards Northwest Denver Nuggets Minnesota Timberwolves Oklahoma City Thunder Portland Trail Blazers Utah Jazz Pacific Golden State Warriors LA Clippers Los Angeles Lakers Phoenix Suns Sacramento Kings Southwest Dallas Mavericks Houston Rockets Memphis Grizzlies New Orleans Pelicans San Antonio Spurs Players Home 2024-25 Audio Pronunciation Guide Player Stats Starting Lineups Free Agent Tracker Transactions Home Full Court Guess Rank IQ Player Path Trivia Hoop Connect Fantasy Home Bracket Challenge NBA Pick'Em Play Yahoo Fantasy Play Sorare NBA FantasyPros Tools FanDuel DFS Draft Kings DFS NBA Bet Authorized Gaming Operators NBA Store Jerseys Men Women Kids Custom Shop Hardwood Classics Hats Footwear Auctions NBA Game Worn NYC Store NBA Photo Store NBATickets.com Official Tickets by Ticketmaster NBA Experiences NBA G League WNBA NBA 2K League Basketball Africa League Draft NBA Finals Free Agency League Pass Games Watch News Stats Standings Teams Players NBA Play Fantasy Store Tickets Affiliates 2025 NBA Finals Summary News Stats Schedule Bracket All Series 2025 NBA Finals Pacers star Tyrese Haliburton undergoes surgery on right Achilles tendon Indiana's star shares a heartfelt message on social media after having surgery that could sideline him for the 2025-26 season. Michael Marot | The Associated Press Updated on June 25, 2025 12:31 AM Though he was injured in Game 7, Tyrese Haliburton proves that it's possible to win different ways in today's NBA. Download the NBA App 2025 NBA playoff results INDIANAPOLIS (AP) — Tyrese Haliburton took the Indiana Pacers to heights few thought possible after they started this season with a 10-15 record. Getting back might take some time after team officials confirmed Monday that the two-time All-Star tore his right Achilles tendon in Game 7 of the NBA Finals , an injury that could cost Haliburton all of next season. The announcement casts a pall on his historic postseason run , which included a litany of incredible plays, buzzer-beating winners and occasionally unprecedented stat lines, and it helped propel the Pacers to their second NBA Finals appearance and within one victory of the franchise’s first championship. “An MRI taken on Monday confirmed that Haliburton tore his right Achilles tendon. Surgery is scheduled later today with Dr. Martin O’Malley at the Hospital for Special Surgery in New York,” the team said . After surgery, Haliburton took to social media to share a heartfelt message. “Words cannot express the pain of this letdown,” Haliburton wrote. “The frustration is unfathomable. I’ve worked my whole life to get to this moment and this is how it ends? Makes no sense. Man. Don’t know how to explain it other than shock. Words cannot express the pain of this letdown. The frustration is unfathomable. I’ve worked my whole life to get to this moment and this is how it ends? Makes no sense. Now that I’ve gotten surgery, I wish I could count the… pic.twitter.com/UyY0iFEp6Z — Tyrese Haliburton (@TyHaliburton22) June 24, 2025 “I know I’ll come out on the other side of this a better man and a better player. And honestly, right now, torn Achilles and all, I don’t regret it. I’d do it again, and again after that, to fight for this city and my brothers. For the chance to do something special.” Coach Rick Carlisle still believes that when Haliburton heals he will be every bit as good — whenever that may be. “He will be back,” Carlisle said following the 103-91 loss at Oklahoma City. “I don’t have any medical information about what’s what, what may or may not have happened. But he’ll be back in time, and I believe he’ll make a full recovery.” A healthy Haliburton certainly makes the Pacers a stronger team. They likely wouldn’t have made it this far without him helping to orchestrate three incredible rallies from seven points down in the final 50 seconds of regulation in three weeks. But after scoring nine points, all on 3-pointers, in the first seven minutes of the biggest game in franchise history, Haliburton’s crash to the floor and sudden departure created a double whammy for Indiana. Not only did they lose their leader, but Indiana also fell short in its title chase. Again. “We just kept battling because we wanted to make Indiana proud, make our fans proud,” three-time All-Star Pascal Siakam said. “We tried our best, but we’ve got to be strong. It’s hard to look forward into the future after you lose like this.” But everyone else is, and the questions about Haliburton’s playing status could make this offseason murkier than expected for Pacers president of basketball operations Kevin Pritchard. There are silver linings, though. At age 25, Haliburton is young enough to return to his pre-injury form and today’s medical advances could help shorten the expected timetable of about 12 months. Tyrese Haliburton's devastating Achilles injury casts a pall over what is otherwise a talented, promising Indiana squad. Many players, including some much older than Haliburton, have shown it is possible to make a full comeback from torn Achilles tendons, and Siakam has no doubt Haliburton will join the club. “I know there’s more coming, it’s just a tough a situation,” Siakam said. “I think back a couple of years and basketball was just not fun, you know, and I got traded here and these guys, they just gave me a boost and playing with these guys is so incredible. I found joy with so much swagger and happiness.” That’s unlikely to change regardless of Haliburton’s health because his effusive, contagious personality even in the face of adversity will continue to be a key feature for Indiana. Players such as Siakam won’t allow that to change. But Indiana also will begin next season with a strong supporting cast intact and room to grow defensively. Indiana’s deep rotation routinely wore down playoff opponents with its racer-like tempo, a model it could replicate again next season as it has done each of the previous two even when Haliburton didn’t play. Nine of Indiana’s top 10 players are under contract for 2025-26, with starting center Myles Turner the lone exception. Indiana’s longest-tenured player has a cap hold estimated at slightly less than $30 million, meaning if he re-signs for something close, Indiana would be barely moving into the first apron and could stay out of that spending threshold with another move. The Pacers also have strong guard play from Andrew Nembhard and T.J. McConnell, who can run the show, as well as emerging defender Ben Sheppard. Aaron Nesmith and Bennedict Mathurin also demonstrated their scoring prowess in the postseason. Both also showed they can defend guards and forwards, giving Indiana perhaps the toughness and flexibility to overcome a Haliburton absence. And Haliburton’s absence could create more minutes for young players such as Mathurin, Sheppard and forward Jarace Walker, a lottery pick in 2023. For now, though, it remains hard to fathom — chasing a title with Haliburton possibly out for most, if not all, of next season. “A lot of us were hurting from the loss and he was up there consoling us. That’s who Tyrese Haliburton is,” McConnell said. “He’s just the greatest.” Related Haliburton injures right leg in Game 7 loss Haliburton's 1st-quarter injury proves to be too much for the Pacers to overcome in their series-ending loss in OKC. Pacers are runners-up to remember Though it couldn't quite pull off the upset, Indiana leaves an indelible legacy with its remarkable postseason run. 5 takeaways: SGA, defense key to Game 7 win Shai Gilgeous-Alexander sets the tone, while OKC rides its defense and depth to finish off the relentless Pacers in Game 7. Game 7 was most-watched Finals game in 6 years The championship win by Oklahoma City averaged 16.4 million viewers on ABC. Related Haliburton injures right leg in Game 7 loss Haliburton's 1st-quarter injury proves to be too much for the Pacers to overcome in their series-ending loss in OKC. Pacers are runners-up to remember Though it couldn't quite pull off the upset, Indiana leaves an indelible legacy with its remarkable postseason run. 5 takeaways: SGA, defense key to Game 7 win Shai Gilgeous-Alexander sets the tone, while OKC rides its defense and depth to finish off the relentless Pacers in Game 7. Game 7 was most-watched Finals game in 6 years The championship win by Oklahoma City averaged 16.4 million viewers on ABC. Latest Reports: Hawks trade 13th pick Queen to Pelicans New Orleans adds another move to its offseason activity with the reported acquisition of 13th overall pick Derik Queen. Silver says league taking look at Achilles tears NBA Commissioner Adam Silver says the league is researching why Achilles injuries have increased. Blazers deal No. 11 pick Coward to Grizzlies Memphis reportedly moves up in the 2025 NBA Draft to acquire the rights to 11th overall pick Cedric Coward from Portland. Reports: Suns trade for Hornets' Williams Phoenix makes a priority of bulking up on the interior with a reported Draft-night trade for Hornets center Mark Williams. Mavs draft Flagg with 1st pick in 2025 Draft The Dallas Mavericks select Cooper Flagg out of Duke with the 1st pick in the 2025 NBA Draft. Nightly Pulse: NBA 2025 Draft Live Blog Check out the NBA 2025 Draft with live picks, updates and highlights from players who will shape the future of the league. NBA Organization NBA ID NBA Official NBA Careers NBA Fan Code of Conduct NBA Initiatives NBA Total Health NBA Cares Jr. NBA / Jr. WNBA NBA Foundation Social Justice Coalition Across The League NBA Communications Lockervision NBA Transactions Shop Global Stores NYC Store NBA Auctions NBA Photostore Subscriptions League Pass Customer Support"
        },
        {
            "title": "Bobby Marks' 2025 Indiana Pacers Offseason Guide | NBA on ESPN ...",
            "url": "https://www.youtube.com/watch?v=CIAHv2AChc0",
            "source_snippet": "3 days ago ... Bobby Marks details his offseason guide for the Indiana Pacers, who lost to the Oklahoma City Thunder in Game 7 of the NBA Finals.",
            "scraped_content": "Bobby Marks’ 2025 Indiana Pacers Offseason Guide | NBA on ESPN - YouTube About Press Copyright Contact us Creators Advertise Developers Terms Privacy Policy & Safety How YouTube works Test new features NFL Sunday Ticket © 2025 Google LLC"
        }
    ]
}